server/app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
---
    def index
        render json: Customer.all, status: :ok

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        customer = Customer.find(session[:customer_id])

INSERT INTO "customers" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Mark"], ["email", "mark@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-08-03 05:56:11.873864"], ["updated_at", "2023-08-03 05:56:11.873864"]]
---
    def create
        customer = Customer.create!(customer_params)

SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def my_history
        customer = Customer.find(session[:customer_id])