server/app/controllers/deals_controller.rb

    def index
        render json: Deal.all, status: :ok
---
SELECT "deals".* FROM "deals"