server/app/controllers/electronics_controller.rb

SELECT "electronics".* FROM "electronics"
---
    def index
        render json: Electronic.all, status: :ok