server/app/controllers/fashions_controller.rb

    def index
        render json: Fashion.all, status: :ok
---
SELECT "fashions".* FROM "fashions"