server/app/controllers/home_products_controller.rb

    def index
        render json: HomeProduct.all, status: :ok
---
SELECT "home_products".* FROM "home_products"