server/app/controllers/products_controller.rb

    def search_products
        search_term = params[:search_term].split(' ').join
        if session.include? :customer_id
            customer = Customer.find(session[:customer_id])
            customer.search_histories.create(title: search_term)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "search_histories" ("title", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hoodies"], ["customer_id", 1], ["created_at", "2023-08-02 17:26:28.703341"], ["updated_at", "2023-08-02 17:26:28.703341"]]