server/app/controllers/sessions_controller.rb

    def create
        customer = Customer.find_by(email: params[:email])
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "john@gmail.com"], ["LIMIT", 1]]